app/Controllers/Blog.php

    public function edit($id){
        $model = new BlogModel();
        $data['post'] = $model->find($id);
---
SELECT *
FROM `post`
WHERE `post`.`id` = '2'